print("Сложение")
a = int(input("Введите первое число: "))
b = int(input("Введите второе число: "))
print("Происходит сложение,",
      "ваш ответ: ", a+b)


print("Вычитание")
c = int(input("Введите первое число: "))
d = int(input("Введите второе число: "))
print("Происходит вычитание,",
      "ваш ответ: ", c-d)


print("Умножение")
e = int(input("Введите первое число: "))
f = int(input("Введите второе число: "))
print("Происходит умножение,",
      "ваш ответ: ", e*f)

print("Деление")
g = int(input("Введите первое число: "))
h = int(input("Введите второе число: "))
print("Происходит деление,",
      "ваш ответ: ", g/h)


print("Возведение в степень")
i = int(input("Введите первое число: "))
n = int(input("Введите второе число: "))
print("Происходит возведение в степень,",
      "ваш ответ: ", i**n)



print("Если ты хочешь узнать формат числа, то...")
j = int(input("Введите число: "))
print(j, "тип переменной : ", type(j))

